# Описание проекта

Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать. Ваша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Ваша первая задача как аналитика — проанализировать базу данных. В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

# Цели проекта:

Проанализировать базу данных, состоящую из пяти связанных таблиц. В них информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта. С помощью SQL-запросов решить задания.

# Описание данных

Таблица *books* содержит данные о книгах:

- book_id — идентификатор книги;
- author_id — идентификатор автора;
- title — название книги;
- num_pages — количество страниц;
- publication_date — дата публикации книги;
- publisher_id — идентификатор издателя.


Таблица *authors* содержит данные об авторах:

- author_id — идентификатор автора;
- author — имя автора.


Таблица *publishers* содержит данные об издательствах:

- publisher_id — идентификатор издательства;
- publisher — название издательства.


Таблица *ratings* содержит данные о пользовательских оценках книг:

- rating_id — идентификатор оценки;
- book_id — идентификатор книги;
- username — имя пользователя, оставившего оценку;
- rating — оценка книги.


Таблица *reviews* содержит данные о пользовательских обзорах:

- review_id — идентификатор обзора;
- book_id — идентификатор книги;
- username — имя автора обзора;
- text — текст обзора.

# Задачи

    - Посчитайте, сколько книг вышло после 1 января 2000 года;
    - Для каждой книги посчитайте количество обзоров и среднюю оценку;
    - Определите издательство, которое выпустило наибольшее число книг толще 50 страниц (так исключите из анализа брошюры);
    - Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
    - Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

# План работы
- импорт библиотек pandas для анализа и sqlalchemy для рабтоы на SQL;
- подключение к базе и выгрузка данных;
    - изучение данных каждой таблицы;
- решение задач;
- выводы и рекомендации.

## Импорт библиотек, подготовка к работе

In [1]:
# импортируем библиотеки
# импортируем библиотеки
import pandas as pd
import sqlalchemy as sa
from sqlalchemy import text, create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': '', # имя пользователя
            'pwd': '', # пароль
            'host': '',
            'port': , # порт подключения
            'db': ''} # название базы данных

connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## подключение к базе и выгрузка данных

In [3]:
# чтобы выполнить SQL-запрос, пишем функцию с использованием Pandas
def get_sql_data(query:str, engine:sa.engine.base.Engine=engine) -> pd.DataFrame:
    '''Открываем соединение, получаем данные sql, закрываем соединение'''
    with engine.connect() as con:
        return pd.read_sql(sql=sa.text(query), con = con)

In [4]:
for name in ['books', 'authors', 'publishers', 'ratings', 'reviews']:
    print(f'Данные таблицы {name}:')
    query = f''' SELECT * 
                FROM {name}
            '''
    name = pd.io.sql.read_sql(query, con = engine)
    display(name.head())
    name.info()
    print('____________________________________________________________________')
    print('')

Данные таблицы books:

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB
____________________________________________________________________

Данные таблицы authors:

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB
____________________________________________________________________

Данные таблицы publishers:

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB
____________________________________________________________________

Данные таблицы ratings:

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB
____________________________________________________________________

Данные таблицы reviews:

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB
____________________________________________________________________

In [5]:
# формируем запрос о минимальном и максимальном времени публикаций и выводим данные
query = '''SELECT MIN(publication_date) AS min_date, 
                MAX(publication_date) AS max_date
            FROM books b 
            ; '''
get_sql_data(query)

     min_date    max_date
0  1952-12-01  2020-03-31

- Таблица с данными о книгах содержит 1000 строк и 6 столбцов. Замечено, что данные о дате публикации в неправильном типе, но в рамках имеющихся задач тип можно не менять. Данные хранят информацию о книгах, изданных до 31 марта 2020 года.

- Таблица с данными авторов содержит 2 столбца и 636 строк, в которых хранится информация об идентификаторе автора и его или их имена, если это группа авторов. Таблица изменений не требует.

- Таблица с информацией об издательствах состоит из 340 строк уникальных названий издательств и изменений не требует.

- Таблица рейтинга пользователей содержит 6456 позиций оценок, принадлежащих каждому из 1000 изданий. Количество оценивавших пользователей меньше, так как каждый пользователь мог оценить по нескольку книг. Изменений таблица не требует.

- Таблица обзоров содержит 2793 рецензии, данные об авторе рецензии и оцениваемой книге. Правок не требует.


## Решение исследовательских задач

### Посчитайть, сколько книг вышло после 1 января 2000 года

In [6]:
# формируем запрос и выводим данные
query = '''SELECT COUNT(book_id)
            FROM books b 
            WHERE publication_date >= '2000-01-01'; '''
get_sql_data(query)

   count
0    821

В имеющихся данных есть информация о 821 книге, вышедшей с 1 января 2000 года.

### Для каждой книги посчитайть количество обзоров и среднюю оценку

In [7]:
# формируем запрос и выводим данные
query = '''SELECT b.title , 
                r.count_review, 
                r2.avg_rating
            FROM books b 
            LEFT JOIN (SELECT book_id, COUNT(review_id) AS count_review
                        FROM reviews r 
                        GROUP BY book_id 
                        ORDER BY book_id) r on r.book_id = b.book_id 
            LEFT JOIN (SELECT book_id , ROUND(avg(rating), 2) AS avg_rating
                        FROM ratings r 
                        GROUP BY book_id) r2 on r2.book_id = b.book_id 
            ORDER BY b.book_id; 
        '''
get_sql_data(query)

,title,count_review,avg_rating
0,'Salem's Lot,2.0,3.67
1,1 000 Places to See Before You Die,1.0,2.50
2,13 Little Blue Envelopes (Little Blue Envelope...,3.0,4.67
3,1491: New Revelations of the Americas Before C...,2.0,4.50
4,1776,4.0,4.00
...,...,...,...
995,Wyrd Sisters (Discworld #6; Witches #2),3.0,3.67
996,Xenocide (Ender's Saga #3),3.0,3.40
997,Year of Wonders,4.0,3.20
998,You Suck (A Love Story #2),2.0,4.50
999,Zen and the Art of Motorcycle Maintenance: An ...,4.0,3.83

В результате запроса получена таблица с данными о названии книги, соттветствующем ей количестве рецензий и среднем рейтинге. Добавляя в запрос условия, например, рейтинг не ниже 4,5 с помощью WHERE, можно выгружать только издания нужных категорий.

### Определить издательство, которое выпустило наибольшее число книг толще 50 страниц, чтобы  исключить из анализа брошюры

In [8]:
# формируем запрос и выводим данные
query = '''WITH 
        id AS (SELECT b.publisher_id, count(b.book_id) 
                FROM books b 
                WHERE b.num_pages >50
                GROUP BY b.publisher_id 
                ORDER BY count(b.book_id) desc 
                LIMIT 1) 
            SELECT p.publisher, id.count
            FROM publishers p 
            LEFT JOIN id ON id.publisher_id = p.publisher_id
            WHERE p.publisher_id = (select publisher_id from id)
     ; '''
get_sql_data(query)

       publisher  count
0  Penguin Books     42

Наиболее продуктивным оказалось издательство Penguin Books, ввыпустившее 42 книги, не являющиеся брошюрами.

### Определить автора с самой высокой средней оценкой книг — учитывайть только книги с 50 и более оценками.

In [9]:
# формируем запрос и выводим данные
query = '''WITH 
books_raiting AS (SELECT book_id, count(rating_id)
                FROM ratings r2 
                GROUP BY book_id
                HAVING count(rating_id)>=50),
books_avg as (SELECT book_id, 
                AVG(rating) OVER(PARTITION BY book_id) AS avg_raiting
                FROM ratings r 
                WHERE book_id IN (SELECT book_id FROM books_raiting))
SELECT a.author, 
        AVG(books_avg.avg_raiting) OVER(PARTITION BY a.author)
FROM books_avg 
JOIN books b ON books_avg.book_id = b.book_id 
JOIN author a ON a.author_id = b.author_id 
ORDER BY avg DESC
LIMIT 1
     ; '''
get_sql_data(query)

                       author       avg
0  J.K. Rowling/Mary GrandPré  4.287097

Наибольшую оценку среди имеющихся данных имеет J.K. Rowling/Mary GrandPré.

In [10]:
# формируем запрос и выводим данные
query = '''WITH 
books_raiting AS (SELECT book_id, 
                        COUNT(rating_id)
                FROM ratings r2 
                GROUP BY book_id
                HAVING COUNT(rating_id)>=50)
SELECT DISTINCT a.author,
    AVG(rating) OVER(PARTITION BY a.author_id) AS avg_rating
FROM books b 
LEFT JOIN author a ON a.author_id = b.author_id 
LEFT JOIN ratings r ON r.book_id = b.book_id
WHERE b.book_id in (SELECT book_id FROM books_raiting)
ORDER BY avg_rating DESC
LIMIT 1
     ; '''
get_sql_data(query)

                       author  avg_rating
0  J.K. Rowling/Mary GrandPré    4.287097

### Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [12]:
# формируем запрос и выводим данные
query = '''WITH 
users_data AS (SELECT username, 
                    COUNT(rating_id) AS count_raiting
                FROM ratings r 
                GROUP BY username
                HAVING count(rating)>48),
review_data as (SELECT username, 
                    COUNT(review_id) AS count_review
                FROM reviews rv 
                GROUP BY username)
SELECT ROUND(AVG(count_review)) AS avg_count_review
FROM users_data ud
LEFT JOIN review_data rd ON rd.username = ud.username
     ; '''
get_sql_data(query)

   avg_count_review
0              24.0

Наиболее активные пользователи, имеющие более 48 оценок, в среднем сделали 24 обзора на имеющиеся книги.

## Выводы

В ходе проведённого анализа данные были загружены и проверены с помощью SQL.

Таблица с данными о книгах содержит 1000 строк и 6 столбцов. Замечено, что данные о дате публикации в неправильном типе, но в рамках имеющихся задач тип можно не менять.

Таблица с данными авторов содержит 2 столбца и 636 строк, в которых хранится информация об идентификаторе автора и его или их имена, если это группа авторов. Таблица изменений не требует.

Таблица с информацией об издательствах состоит из 340 строк уникальных названий издательств и изменений не требует.

Таблица рейтинга пользователей содержит 6456 позиций оценок, принадлежащих каждому из 1000 изданий. Количество оценивавших пользователей меньше, так как каждый пользователь мог оценить по нескольку книг. Изменений таблица не требует.

Таблица обзоров содержит 2793 рецензии, данные об авторе рецензии и оцениваемой книге. Правок не требует.

Решение поставленных задач дало следующие результаты:

- с 1 января 2000 года вышло 821 книга, что составляет 82,1% имеющейся базы данных.
- в результате запроса получена таблица с данными о названии книги, сответствующим ей количестве рецензий и среднем рейтинге. Добавляя в запрос условия, например, рейтинг не ниже 4,5 с помощью WHERE, можно выгружать только издания нужных категорий.
- наиболее продуктивным оказалось издательство Penguin Books, ввыпустившее 42 книги, не являющиеся брошюрами.
- наибольшую оценку среди имеющихся данных имеет J.K. Rowling/Mary GrandPré.
- наиболее активные пользователи, выставившие книгам более 48 оценок, в среднем сделали 24 обзора на имеющиеся книги.

Несмотря на нестабильную ситуацию и смену привычного режима жизни, люди не перестали выпускать и читать книги. В распоряжении менеджеров информация о 821 книге, изданной с 1 января по 31 марта 2000 года. Книги остаются популярным продуктом потребления челевечества и развитие в области современной подачи литературы - электронной библиотеки - может быть персепктивным.

Для более детального изучения информации о современных изданиях, пользующихся спросом были получены данные о названии книги, сответствующим ей количестве рецензий и среднем рейтинге. Из этой таблицы можно получить информацию о наиболее популярных и высоко оцениваемых произведениях, чтобы предлагать их в первую очередь.

Для рассмотрения наиболее общирных издательств был получен список и отобрано самое продуктивное, с точки зрения выпуска не являющихся брошюрами изданий.

Для оценки популярных авторов из данных была взята информация об авторах с наибольшим количеством оценок и наибольшими рейтингами. В имеющейся базе наибольшую оценку имеет J.K. Rowling/Mary GrandPré.

Рейтинг книги формируется не только за чсёт оценки читателей, но и благодаря отзывам и рецензиям на произведение и издание в целом. По имеющимся данным наиболее активные пользователи, выставившие более 48 оценок, в среднем сделали 24 обзора на имеющиеся книги. Пользователей сервиса столит поощрять и привлекать к написанию отзывов и выставлению оценок прочитанным произведениям. Это позволит в перспективе не только создать собственный рейтинг, но и предлагать пользователям произведения, с учётом их предпочтений.

In [13]:
print('код работает во всех строках')

код работает во всех строках